(ns genot-centre.mutations)

(def character-sets
  [#{"Ａ" "ɑ" "ａ" "a" "α" "Ꭺ" "а" "A" "Α"}
   #{"ｂ" "Ｂ" "ᛒ" "β" "B" "ß" "Β" "В" "Ᏼ" "b"
     "Ь" "ʙ" "ℬ"}
   #{"Ⅽ" "ϲ" "Ϲ" "C" "с" "Ｃ" "ｃ" "С" "ⅽ" "c"
     "Ꮯ" "ℂ" "℃" "ℭ"}
   #{"d" "Đ" "ḍ" "Ⅾ" "Ꭰ" "đ" "Ｄ" "ⅾ" "ժ" "ｄ"
     "ԁ" "D" "ⅅ" "ⅆ"}
   #{"e" "Ę" "Е" "E" "ｅ" "Ε" "Ｅ" "Ꭼ" "е" "℮"
     "ℯ" "ℰ" "⅀" "ⅇ"}
   #{"F" "f" "Ｆ" "ｆ" "Ϝ" "℉" "ℱ" "Ⅎ"}
   #{"ｇ" "ɡ" "G" "Ｇ" "Ꮐ" "Ԍ" "g" "ɢ" "ℊ" "⅁"}
   #{"Ꮋ" "ｈ" "ʜ" "Ｈ" "Η" "H" "Н" "һ" "h" "ℋ"
     "ℌ" "ℍ" "ℎ" "ℏ"}
   #{"Ι" "ا" "ⅰ" "Ⅰ" "i" "Ꭵ" "l" "ᛁ" "ɩ" "I" "І"
     "ｉ" "і" "ℐ" "ℑ" "℩" "ℹ" "ⅈ"}
   #{"ϳ" "ј" "Ј" "j" "J" "Ꭻ" "յ" "ｊ" "ⅉ"}
   #{"K" "ｋ" "ᛕ" "K" "κ" "Κ" "К" "Ｋ" "k" "Ꮶ"}
   #{"ｌ" "Ꮮ" "ⅼ" "L" "ι" "Ⅼ" "Ｌ" "ا" "ʟ" "l"
     "ℒ" "ℓ"}
   #{"Ⅿ" "Μ" "M" "М" "ⅿ" "Ｍ" "Ꮇ" "ᛖ" "ｍ" "m"
     "Ϻ" "ℳ"}
   #{"N" "n" "Ｎ" "ｎ" "ɴ" "Ν" "ℵ"}
   #{"ο" "О" "Ｏ" "ｏ" "Ο" "O" "0" "Օ" "о" "o"
     "ℴ" "♡"}
   #{"Ꮲ" "p" "ρ" "P" "ｐ" "р" "Ρ" "Р" "Ｐ" "℗"
     "℘" "ℙ"}
   #{"Ⴍ" "Q" "q" "Ｑ" "ｑ" "Ⴓ" "ℚ"}
   #{"ｒ" "Ꮢ" "ᚱ" "R" "ʀ" "r" "Ｒ" "ℛ" "ℜ" "ℝ"
     "℞" "℟"}
   #{"ｓ" "s" "ѕ" "S" "Ｓ" "Ѕ" "Ⴝ" "Ꮪ" "Տ"}
   #{"T" "Т" "✞" "Ꭲ" "𝙏" "Ｔ" "𝓣" "τ" "✛" "♱"
     "♰" "✚" "✟" "ｔ" "✙" "t" "𝒯" "𝓉" "𝕿" "Ⓣ"
     "✝" "☩" "Τ" "☨" "ⓣ" "ℸ"}
   #{"Ｕ" "ｕ" "Ա" "μ" "Ս" "υ" "U" "u" "⋃" "℧"}
   #{"ν" "Ѵ" "v" "ѵ" "ｖ" "Ꮩ" "Ｖ" "V" "ⅴ" "Ⅴ"
     "℣"}
   #{"ѡ" "Ꮃ" "W" "w" "Ｗ" "ｗ"}
   #{"ｘ" "Х" "χ" "x" "х" "Ｘ" "Χ" "ⅹ" "X" "Ⅹ"}
   #{"ʏ" "Ｙ" "ｙ" "Y" "Ү" "у" "y" "Υ" "γ" "ℽ"}
   #{"Ꮓ" "Ζ" "Z" "z" "Ｚ" "ｚ" "ℤ"}])

(def character-mutations
  (reduce (fn [acc homoglyphs]
            (reduce #(assoc %1 %2 homoglyphs)
                    acc
                    homoglyphs))
          {}
          character-sets))

(defn- mutate-char
  [ch & {:keys [mutation-probability]
         :or {mutation-probability 0.9}}]
  (if-let [mutations (and (< (rand) mutation-probability)
                          (character-mutations ch))]
    (-> mutations vec rand-nth)
    ch))

(defn mutate-text
  [s]
  (apply str (map (comp mutate-char str) s)))
